IDEA Open Model
SteelSetupHKG Class
Compatible with IDEA StatiCa 20.1
 Steel setup IND class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupHKG
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SteelSetupHKG : SteelSetup
Public Class SteelSetupHKG
	Inherits SteelSetup
The SteelSetupHKG type exposes the following members.
Constructors
Name | Description
SteelSetupHKG
Initializes a new instance of the SteelSetupHKG class
Top
Methods
Name | Description
FrictionCoefficientPboltDefault
 Friction Coefficient Pbolt Default
 (Overrides SteelSetup.FrictionCoefficientPboltDefault().)
Top
See Also
Reference
IdeaRS.OpenModel Namespace